// Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.
// Console.WriteLine("Введите пятизначное число: ");
// string num = Convert.ToString(Console.ReadLine());
// int size = num.Length;
// if (size == 5)
// {
//     if (num[0] == num[4] && num[1] == num[3])
//     {
//             Console.WriteLine("Является палиндромом");
//     }
//     else
//     {
//         Console.WriteLine("Не является палиндромом");
//     }
// }
// else
// {
//     Console.WriteLine("Введено неверное число");
// }

